<?php

use yii\db\Migration;

class m260128_104850_insert_20_authors extends Migration
{
    public function safeUp()
    {
        $authors = [
            ['Иванов', 'Иван', 'Иванович'],
            ['Петров', 'Пётр', 'Петрович'],
            ['Сидоров', 'Сидор', 'Сидорович'],
            ['Кузнецов', 'Алексей', 'Александрович'],
            ['Смирнова', 'Анна', 'Владимировна'],
            ['Попова', 'Елена', null],
            ['Васильев', 'Дмитрий', 'Сергеевич'],
            ['Морозова', 'Мария', 'Игоревна'],
            ['Козлов', 'Николай', null],
            ['Новикова', 'Татьяна', 'Александровна'],
            ['Фёдоров', 'Виктор', null],
            ['Михайлова', 'Ольга', 'Ивановна'],
            ['Беляев', 'Сергей', null],
            ['Тарасова', 'Юлия', 'Павловна'],
            ['Александров', 'Владимир', 'Петрович'],
            ['Соколова', 'Наталья', null],
            ['Горбачев', 'Константин', 'Алексеевич'],
            ['Крылова', 'Людмила', 'Сергеевна'],
            ['Павлов', 'Андрей', null],
            ['Егоров', 'Вячеслав', 'Игоревич'],
        ];

        $time = time();

        foreach ($authors as $author) {
            $this->insert('{{%author}}', [
                'last_name' => $author[0],
                'first_name' => $author[1],
                'middle_name' => $author[2],
                'created_at' => $time,
                'updated_at' => $time,
            ]);
        }
    }

    public function safeDown()
    {
    }
}
